combat_tables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-20 Fri 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>D&amp;D 2e Tables</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Joseph Vadella" />
</head>
<body>
<div id="content">
<h1 class="title">D&amp;D 2e Tables</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org663a1e1">1. D&amp;D Tables</a></li>
<li><a href="#orgb7a5421">2. Combat Modifiers</a></li>
<li><a href="#orga6cc719">3. Cover &amp; Concealment</a></li>
<li><a href="#org89d5872">4. Morale</a></li>
<li><a href="#orgd77cdf8">5. Wind &amp; Combat</a></li>
<li><a href="#orgd0092e4">6. Initiative Modifiers</a></li>
<li><a href="#org4521791">7. Weapon Type vs Armor</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="http://josephvadella.com/weather_tables">Weather Tables</a></td>
<td class="org-left"><a href="http://josephvadella.com/combat_tables">Combat Tables</a></td>
<td class="org-left"><a href="http://josephvadella.com/stat_tables">Stat Tables</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-org663a1e1" class="outline-2">
<h2 id="org663a1e1"><span class="section-number-2">1</span> D&amp;D Tables</h2>
<div class="outline-text-2" id="text-1">
<p>
These are tables that would be useful for combat.
</p>

<p>
I have tried to put the ones which will be referrenced most frequently at the top.
</p>
</div>
</div>


<div id="outline-container-orgb7a5421" class="outline-2">
<h2 id="orgb7a5421"><span class="section-number-2">2</span> Combat Modifiers</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Situation</th>
<th scope="col" class="org-right">Attack Roll Mod</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Attacker on high ground</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-left">Defender Invisible</td>
<td class="org-right">-4</td>
</tr>

<tr>
<td class="org-left">Defender Off-balance</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-left">Defender Sleeping or Held</td>
<td class="org-right">Automatic</td>
</tr>

<tr>
<td class="org-left">Defender Stunned or Prone</td>
<td class="org-right">+4</td>
</tr>

<tr>
<td class="org-left">Defender Surprised</td>
<td class="org-right">+1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Missile fire, LONG</td>
<td class="org-right">-5</td>
</tr>

<tr>
<td class="org-left">Missile fire, MEDIUM</td>
<td class="org-right">+2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Rear Attack</td>
<td class="org-right">+2</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orga6cc719" class="outline-2">
<h2 id="orga6cc719"><span class="section-number-2">3</span> Cover &amp; Concealment</h2>
<div class="outline-text-2" id="text-3">
<p>
These numbers are added to the attack roll.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Target is</th>
<th scope="col" class="org-right">Cover</th>
<th scope="col" class="org-right">Concealment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">25% hidden</td>
<td class="org-right">-2</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-left">50% hidden</td>
<td class="org-right">-4</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">75% hidden</td>
<td class="org-right">-7</td>
<td class="org-right">-3</td>
</tr>

<tr>
<td class="org-left">90% hidden</td>
<td class="org-right">-10</td>
<td class="org-right">-4</td>
</tr>
</tbody>
</table>

<p>
Hiding behind a wall offers cover, hiding in a thicket or bush offers concealment.
</p>
</div>
</div>


<div id="outline-container-org89d5872" class="outline-2">
<h2 id="org89d5872"><span class="section-number-2">4</span> Morale</h2>
<div class="outline-text-2" id="text-4">
<p>
This is a list of morale modifiers
remember that to make a morale roll, roll 2d6 and if it's higher than the Morale of the creature, it keeps fighting.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Situation</th>
<th scope="col" class="org-right">Mod</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Abandoned by friends</td>
<td class="org-right">-6</td>
</tr>

<tr>
<td class="org-left">3/4 Health or Group</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">1/2 Health or Group</td>
<td class="org-right">-4</td>
</tr>

<tr>
<td class="org-left">Creature is Chaotic</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-left">Creature is Lawful</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-left">Creature fighting hated enemy</td>
<td class="org-right">+4</td>
</tr>

<tr>
<td class="org-left">Surprised</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">Fighting Magic-users</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">Defending Home</td>
<td class="org-right">+3</td>
</tr>

<tr>
<td class="org-left">Defensive Terrain Advantage</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-left">Each additional check this round</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-left">Leader of diff alignment</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-left">Most Powerful Ally Killed</td>
<td class="org-right">-4</td>
</tr>

<tr>
<td class="org-left">NPC has been favored</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-left">NPC has been poorly treated</td>
<td class="org-right">-4</td>
</tr>

<tr>
<td class="org-left">No enemy slain</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">Outnumbered 3+ to 1</td>
<td class="org-right">-4</td>
</tr>

<tr>
<td class="org-left">Outnumber opponent 3+ to 1</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-left">Unable to affect opponent</td>
<td class="org-right">-8</td>
</tr>

<tr>
<td class="org-left">Magic-user on same side</td>
<td class="org-right">+2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&lt;1/2HD</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">1/2-1HD</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-left">4-8+HD</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-left">9-14+HD</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-left">15HD or more</td>
<td class="org-right">+3</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgd77cdf8" class="outline-2">
<h2 id="orgd77cdf8"><span class="section-number-2">5</span> Wind &amp; Combat</h2>
<div class="outline-text-2" id="text-5">
<p>
When precipitation is occuring, go down the chart 1 line.
If the precipitation is heavy or higher, move down 2.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Windspeed mph</th>
<th scope="col" class="org-left">Missile Combat</th>
<th scope="col" class="org-right">Melee Combat</th>
<th scope="col" class="org-left">Move v. Wind</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0 to 10</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">11 to 20</td>
<td class="org-left">0/-1/-2/-3</td>
<td class="org-right">-</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">21 to 30</td>
<td class="org-left">-1/-2/-3/X</td>
<td class="org-right">-1</td>
<td class="org-left">0.75</td>
</tr>

<tr>
<td class="org-left">31 to 45</td>
<td class="org-left">-2/-4/X/X</td>
<td class="org-right">-2</td>
<td class="org-left">2/3</td>
</tr>

<tr>
<td class="org-left">46 to 79</td>
<td class="org-left">-4/-6/X/X</td>
<td class="org-right">-4</td>
<td class="org-left">0.5</td>
</tr>

<tr>
<td class="org-left">80+</td>
<td class="org-left">X/X/X/X</td>
<td class="org-right">-8</td>
<td class="org-left">0.25</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgd0092e4" class="outline-2">
<h2 id="orgd0092e4"><span class="section-number-2">6</span> Initiative Modifiers</h2>
<div class="outline-text-2" id="text-6">
<p>
Use these numbers whenever initiative is determined.
</p>

<p>
To qualify for a modifier, ALL MEMBERS must qualify.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Situation</th>
<th scope="col" class="org-right">Mod</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Hastened</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">Slowed</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-left">On High Ground</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-left">Set to receive a charge</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">Wading/Slippery Footing</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-left">Wadding in deep water</td>
<td class="org-right">+4</td>
</tr>

<tr>
<td class="org-left">Foreign Environment</td>
<td class="org-right">+6</td>
</tr>

<tr>
<td class="org-left">Hindered (tangled, climbing, held)</td>
<td class="org-right">+3</td>
</tr>

<tr>
<td class="org-left">Waiting</td>
<td class="org-right">+1</td>
</tr>
</tbody>
</table>

<p>
A Foreign Environment would be something like swimming underwater. This is quite rare. Think of this as a modifer when some fundamental rules about fighting have changed.
</p>
</div>
</div>


<div id="outline-container-org4521791" class="outline-2">
<h2 id="org4521791"><span class="section-number-2">7</span> Weapon Type vs Armor</h2>
<div class="outline-text-2" id="text-7">
<p>
To use this table: When attacking someone in Chainmail with a Bludgeoning Weapon, add +2 to your Attack Roll
</p>

<p>
Leather includes Padded Armor and Hides and Plate includes Bronze Plate.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Armor</th>
<th scope="col" class="org-right">Slash</th>
<th scope="col" class="org-right">Pierce</th>
<th scope="col" class="org-right">Bludgeon</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Banded mail</td>
<td class="org-right">-2</td>
<td class="org-right">0</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-left">Brigandine</td>
<td class="org-right">-1</td>
<td class="org-right">-1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Chainmail</td>
<td class="org-right">-2</td>
<td class="org-right">0</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-left">Field Plate</td>
<td class="org-right">-3</td>
<td class="org-right">-1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Full Plate</td>
<td class="org-right">-4</td>
<td class="org-right">-3</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Leather</td>
<td class="org-right">0</td>
<td class="org-right">+2</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Plate</td>
<td class="org-right">-3</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Ring mail</td>
<td class="org-right">-1</td>
<td class="org-right">-1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Scale Mail</td>
<td class="org-right">0</td>
<td class="org-right">-1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Splint Mail</td>
<td class="org-right">0</td>
<td class="org-right">-1</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-left">Studded Leather</td>
<td class="org-right">-2</td>
<td class="org-right">-1</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joseph Vadella</p>
<p class="date">Created: 2020-11-20 Fri 13:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
